/**************************************************************************

mini80 或者 mini80E 按键，上 s6，下 s14，左 s11， 右 s9， s4 重新开始

可以按照自己需要重新定义键盘扫描程序中的值，在key_sweep.h 中


****************************************************************************/

#include "reg52.h"
#include "KEY_SWEEP.H" 
#include "SNAKE.h"
#include "9325tp.h"


//=========================================主程序========================================//
main()
{
     ILI9325_Initial();
	Init_SNAKE();
	while(1)
	{
	Run_SNAKE();
	Key();
	}
}
